src/DataProcessors/РасчетПремии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>РасчетПремии</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/DataProcessors/РасчетПремии/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура РассчитатьНаСервере()
	
	Премии.Очистить();
	Продажи = РегистрыНакопления.Продажи.Обороты(Период.ДатаНачала,Период.ДатаОкончания);
	
	СписокСотрудников = СписокСотрудников();
	
	Для каждого Сотрудник Из СписокСотрудников Цикл
	
		Отбор = Новый Структура;
		Отбор.Вставить("Сотрудник", Сотрудник);
		
		ПродажиПоСотруднику = Продажи.НайтиСтроки(Отбор);
		
		Если ПродажиПоСотруднику.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СуммаПремии = 0;
		Для каждого СтрокаПродажиПоСотруднику Из ПродажиПоСотруднику Цикл
			
			ТипНоменклатуры = СтрокаПродажиПоСотруднику.Номенклатура.ТипНоменклатуры;
			Процент = ?(ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга,ПроцентУслуги,ПроцентТовары);
			
			Премия = СтрокаПродажиПоСотруднику.Сумма / 100 * Процент;
			
			СуммаПремии = СуммаПремии + Премия;
			
		КонецЦикла;
		
		СтрокаПремии = Премии.Добавить();
		СтрокаПремии.Сотрудник = Сотрудник;
		СтрокаПремии.Сумма = СуммаПремии;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Рассчитать(Команда)
	
	РассчитатьНаСервере();
	
	Элементы.ПремииСумма.ТекстПодвала = Премии.Итог("Сумма");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СписокСотрудников()

	ВыборкаПоСотрудникам = Справочники.Сотрудники.Выбрать();
	Результат = НовыйМассив();
	
	Пока ВыборкаПоСотрудникам.Следующий() Цикл
	
		Если ВыборкаПоСотрудникам.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;
		
		Результат.Добавить(ВыборкаПоСотрудникам.Ссылка);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция НовыйМассив()
	Возврат Новый Массив;
КонецФункции
